
import './App.css'
import {Nav, SectionExample} from "./Components/index"
import { Home, PageExample} from './Pages/index';


import { BrowserRouter as Router, Routes, Route,} from "react-router-dom";

function App() {
  
  const financeSystemCardData = [
    [
      [
        "إدارة الحسابات البنكية",
        [
        "إمكانية إضافة أكثر من حساب بنكي مع بيانات البنك الاسم - رقم الحساب – العملة - الملاحظات)",
        "عرض الرصيد الحالي لكل حساب",
        "تحديث الرصيد تلقائيًا عند إصدار إيصال استلام مرتبط بالحساب",
        "تسجيل عمليات الإيداع أو السحب اليدوية تحويلات داخلية أو مصروفات بنكية)",
        "عرض تقرير تفصيلي بحركات كل حساب خلال فترة معينة تاريخ) - نوع العملية – المبلغ – المستخدم)",
        ]
      ],
      [
        "إدارة الخزائن النقدية (الكاش)",
        [
        "تعريف خزائن الشركة (مثل: خزينة المكتب الرئيسي - خزينة الفرع - خزينة المشرف)",
        "إدخال أرصدة بداية الفترة",
        "تسجيل عمليات التحصيل أو الصرف النقدي بشكل يومي",
        "تحديث الرصيد بشكل لحظي بعد كل عملية",
        "تقرير حركة الخزينة يوضح جميع العمليات التي تمت عليها خلال فترة معينة",
        ]
      ],
      [
        "إيصالات الاستلام",
        [
        "إنشاء إيصال استلام عند: إنشاء إيصال استلام عند: , دفع العميل نقذا في مقر الشركة",
        ". بيانات الإيصال تشمل: رقم الإيصال وتاريخه , اسم العميل ورقم التواصل / المبلغ وطريقة الدفع (تحويل - نقدي). / اسم البنك أو الخزينة التي أودع فيها المبلغ / اسم المستخدم الذي أصدر الإيصال",
        "عند حفظ الإيصال: يتم تحديث الرصيد في الحساب البنكي أو الخزينة تلقائيا / يتم ربط الإيصال بالعميل ليظهر في سجل مدفوعاته / إمكانية طباعة الإيصال بصيغة جاهزة مختومة بشعار الشركة",
        ]
      ],
      [
        "القيود المالية المبسطة:",
        [
          "القيود المالية المبسطة: ه مصروفات تشغيلية إيجار) - كهرباء - عمولة - مواصلات - إلخ). / تحويلات داخلية بين البنوك والخزائن",
          "كل قيد يحتوي على: التاريخ - البيان - الحساب المدين - الحساب الدائن - القيمة",
        ]
      ],
      [
        "أرصدة الشركة",
        [
          ". عرض مباشر لرصيد كل بنك وكل خزينة على حدة.",
          "عرض إجمالي رصيد الشركة الكلي (مجموع الحسابات البنكية + الخزائن).",
          ". إمكانية تصفية وعرض الأرصدة حسب التاريخ أو نوع الحساب.",
        ]
      ]
    ]
  ]
  const crmSystemCardData =  [
    [
      [
        "تسجيل بيانات العميل الأساسية",
        [
          "الاسم الرباعي",
          "الرقم القومي أو رقم الجواز",
          "رقم الهاتف",
          "البريد الإلكتروني (اختياري)",
          "العنوان",
          "مصدر العميل (مثل مندوب تسويق الكتروني، توصية، إلخ)",
          "ملاحظات عامة",
        ]
      ],
      [
        "تسجيل العميل بدون حجز",
        [
          "يمكن تسجيل عميل جديد دون ربطه بأي رحلة بهدف حفظ بياناته للتواصل أو التسويق لاحقا.",
          '. يمكن لاحقا تحويل العميل إلى "عميل حاجز " عند تحديد الرحلة المطلوبة.',
          ". تصنيف العملاء داخل النظام إلى: عملاء حاجزين / عملاء محتملين (لم يحجزوا بعد)",
          ". إمكانية إرسال عروض تسويقية أو تذكيرات تلقائية لهؤلاء العملاء."
        ]
      ],
      [
        "إدارة الحجوزات",
        [
          ". يمكن ربط الحجز بملف العميل الحالي دون الحاجة لإعادة إدخال بياناته.",
          "تسجيل تفاصيل الرحلة المرتبطة بالعميل، مثل:",
          "نوع الرحلة (عمرة / حج / أخرى)",
          "تاريخ السفر والعودة",
          "وسيلة السفر (جوي / بري)",
          "الفندق أو مستوى الإقامة",
          "عدد الأفراد المسافرين",
          "ملاحظات خاصة بالحجز",
          "عرض سجل الحجوزات السابقة والحالية لكل عميل",
        ]
      ],
      [
        "الربط مع الإيصالات والمدفوعات",
        [
          "كل إيصال يتم ربطه تلقائيا باسم العميل",
          ". تظهر جميع الإيصالات والمدفوعات الخاصة بالعميل في ملفه.",
          ". النظام يحسب تلقائيا",
          "إجمالي المبالغ المدفوعة",
          "المبالغ المتبقية",
          "آخر عملية دفع وتاريخها",
        ]
      ],
      [
        "البحث والاستعلام",
        [
          "يوفر النظام صفحة مخصصة للبحث والاستعلام عن العملاء والحجوزات بسهولة من خلال:",
          "الاسم / رقم الهاتف / رقم الإيصال / نوع الرحلة",
          "وتعرض صفحة العميل جميع بياناته وحالته ومدفوعاته وسجل رحلاته في مكان واحد."
        ]
      ]
    ]
  ]


  return (
    <>
    <Nav/>
    <Router basename='/'>
      <Routes>
        <Route path='/' element={<Home/>} />
        <Route path='/financeSystem' element={<PageExample pageCardListItem = {financeSystemCardData}/>} />
        <Route path='/crmSystem' element={<PageExample pageCardListItem = {crmSystemCardData}/>} />
      </Routes>
    </Router>
    
    




    {/* <PageExample 
        tag="crmSystem"
        title="CRM SYSTEM"
        LargeCardTitle = "نظام إدارة العملاء"    
        LargeCardText = "يتيح النظام إدارة قاعدة بيانات متكاملة لجميع العملاء والمستفيدين من خدمات الشركة، سواء حجزوا فعليًا أو لم يحجزوا بعد. يستخدم النظام التسجيل بيانات العملاء، متابعة حالتهم المالية والإدارية، وربطهم بالحجوزات والإيصالات والتقارير المختلفة"
        pageCardListItem = {crmSystemCardData}    
    /> */
    }
    <p className='footer g-btn bg-gray-200'>Copyright All Reserved 2026</p>
    </>
    
  )
}

export default App
